# Виселица
# Классическая игра "Виселица". Компьютер случайным образом выбирает слово,
# которое игрок должен отгадать буква за буквой. Если игрок не сумеет
# отгадать за отведенное количество попыток, на экране появится фигурка повешенного.

import random

# Константа - человек

HANGMAN = (
"""
 ------
 |    |
 |
 |  
 | 
 |
 |
 |
 |
---------
""",
"""
 ------
 |    |
 |    0
 |  
 | 
 |
 |
 |
 |
---------
""",
"""
 ------
 |    |
 |    0
 |   -+-
 | 
 |
 |
 |
 |
---------
""",
"""
 ------
 |    |
 |    0
 |  /-+-
 | 
 |
 |
 |
 |
---------
""",
"""
 ------
 |    |
 |    0
 |  /-+-/
 | 
 |
 |
 |
 |
---------
""",
"""
 ------
 |    |
 |    0
 |  /-+-/
 |    |
 |
 |
 |
 |
---------
""",
"""
 ------
 |    |
 |    0
 |  /-+-/
 |    |
 |    |
 |   |
 |   |
 |
---------
""",
"""
 ------
 |    |
 |    0
 |  /-+-/
 |    |
 |    |
 |   | |
 |   | |
 |
---------
"""
)
MAX_WRONG = len(HANGMAN) - 1
WORDS = ("терминатор", "блазар", "экзопланета", "эксцентриситет", "пульсар", "сверхгигант")
# Инициализация переменных
word = random.choice(WORDS) # Слово для отгадывания
so_far = "-" * len(word) # По одному дефису на букву
wrong = 0 # Кол-во ошибок игрока
used = [] # Буквы, которые уже предложены

print("Добро пожаловать в игру 'Виселица'! Правила известны, так что вперед и удачи!")

while wrong < MAX_WRONG and so_far != word:
    print(HANGMAN[wrong])
    print("\nВы уже предлагали эти буквы:\n", used)         # задаем форму отображения предложенных букв
    print("\nВаш успех сейчас выглядит так:\n", so_far)     # задаем форму отгаданных букв
    guess = input("\nВведите букву: ")
    guess = guess.lower()

    while guess in used:    # защита от повторных букв
        print("Вы уже предлагали букву", guess)
        guess = input("\nВведите букву: ")
        guess = guess.lower()
    used.append(guess)

    if guess in word:       # отвечает за правильную постановку отгаданной буквы
        print("\nДа! буква", guess, "есть в слове.")
        # Новая строка с отгаданной буквой
        new = ""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new

    else:                   # сообщает о неудаче
        print("\nК сожалению, буквы", guess, "нет в слове.")
        wrong += 1

if wrong == MAX_WRONG:
    print(HANGMAN[wrong])
    print("Его уже не спасти... Бедняга.")

else:
    print("Ого, вы спасли его, поздравляю!")

input("\nНажми Enter, чтобы закончить.")